app/Controllers/SuratMasukController.php

    public function index()
    {
        $suratMasukModel = new SuratMasuk();
        $suratmasuk = $suratMasukModel->findAll();
---
SELECT *
FROM `surat_masuk`

    public function delete($id_surat_masuk)
    {
        $suratMasukModel = new SuratMasuk();
        $suratMasukModel->delete($id_surat_masuk);
---
DELETE FROM `surat_masuk`
WHERE `id_surat_masuk` IN ('7')

    public function edit($id_surat_masuk)
    {
        $suratMasukModel = new SuratMasuk();
        $suratmasuk = $suratMasukModel->find($id_surat_masuk);
---
SELECT *
FROM `surat_masuk`
WHERE `surat_masuk`.`id_surat_masuk` = '8'